//*****************************************************
//
// ブラーイベントの処理[blurEvent.h]
// Author:髙山桃也
//
//*****************************************************
#ifndef _BLUREVENT_H_    // 二重インクルードの防止
#define _BLUREVENT_H_

//*****************************************************
// インクルード
//*****************************************************
#include "object.h"

//*****************************************************
// クラスの定義
//*****************************************************
class CBlurEvent : public CObject
{
public:
    CBlurEvent();	// コンストラクタ
	~CBlurEvent();	// デストラクタ

    // メンバ関数
    HRESULT Init(void); // 初期化
    void Uninit(void);  // 終了
    void Update(void);  // 更新
    void Draw(void);  // 描画

private:
};

#endif
