//*****************************************************
//
// ライトの処理[light.h]
// Author:髙山桃也
//
//*****************************************************
#ifndef _LIGHT_H_	// 二重インクルード防止
#define _LIGHT_H_

//*****************************************************
// マクロ定義
//*****************************************************
#define MAX_LIGHT				(3)			//ライトの最大数

//*****************************************************
// クラス定義
//*****************************************************
class CLight
{
public:
	// メンバ関数
	HRESULT Init(void);	// 初期化
	void Uninit(void);	// 終了
	void Update(void);	// 更新

private:
	// メンバ変数
	D3DLIGHT9 m_aLight[MAX_LIGHT];	// ライトの情報
	int m_nCurrent;	// 選択番号
};

#endif