//*****************************************************
//
// UIの処理[UI.h]
// Author:髙山桃也
//
//*****************************************************
#ifndef _UI_H_	// 二重インクルード防止
#define _UI_H_

//*****************************************************
// インクルード
//*****************************************************
#include "object2D.h"

//*****************************************************
// クラスの定義
//*****************************************************
class CUI : public CObject2D
{
public:
	CUI(int nPriority = 3);	// コンストラクタ
	~CUI();	//	デストラクタ

	static CUI *Create(void);	// 生成処理
	HRESULT Init(void);	// 初期化処理
	void Uninit(void);	// 終了処理
	void Update(void);	// 更新処理
	void Draw(void);	// 描画処理

private:
};

#endif